
/*
****조건문**
    
    **,**
    
    **반복문**
    
    **,**
    
    배열은 사용하지 말 것
[2] 5명 학생의 국어 점수(0~100)를 **모두 입력 받은 후** 다음과 같이 학점을 부여하여 **각 학점의 학생수 내림차순으로** 해당 학점과 학생수를 출력하는 프로그램 작성. (동일 학생수를 갖는 학점들 순서는 무관)

90이상: A,     80이상: B,      70이상: C,      60이상: D

출력 예시:  A:2    D:2    C:1     B:0
*/


#include <stdio.h>

int main(){
    int a = 0;
    int b =0;
    int c =0;
    int d =0;
    int e =0;

    printf("점수 입력: ");
    scanf("%d",&a);
    printf("점수 입력: ");
    scanf("%d",&b);
    printf("점수 입력: ");
    scanf("%d",&c);
    printf("점수 입력: ");
    scanf("%d",&d);
    printf("점수 입력: ");
    scanf("%d",&e);

    // 조건문을 사용하지 않고 어떻게 해야할까?
    //조건연산자
    //빈칸은 에러?
    //sorting의 시작?

}







